### CRUD:
- Create
- Replace
- Update
- Delete

===============================

### IMPORTS & GET DATABASE INFO

In [2]:
from jsons import read_json_to_dict
from mysql_driver import MySQL
import pandas as pd
from sqlalchemy import create_engine

json_readed = read_json_to_dict("sql_server_settings.json")
IP_DNS = json_readed["IP_DNS"]
USER = json_readed["USER"]
PASSWORD = json_readed["PASSWORD"]
BD_NAME = json_readed["BD_NAME"]
PORT = json_readed["PORT"]

ValueError: Expecting value: line 4 column 13 (char 64)

In [2]:
# Connect to MySQL
mysql_db = MySQL(IP_DNS=IP_DNS, USER=USER, PASSWORD=PASSWORD, BD_NAME=BD_NAME, PORT=PORT)
mysql_db.connect()

NameError: name 'MySQL' is not defined

============== 

### DROP TABLE

In [3]:
# Drop table if it already exist using execute() method.
#mysql_db.cursor.execute("DROP TABLE IF EXISTS people")

mysql_db.execute_interactive_sql(sql="DROP TABLE IF EXISTS people")

(1142, "DROP command denied to user 'tb_user'@'83.32.165.165' for table 'people'")

0

============== 

### CREATE TABLE

In [7]:
# Create table as per requirement
create_table_sql = """CREATE TABLE people(
    ID INT(11) NOT NULL AUTO_INCREMENT,
    MOMENTO TIMESTAMP NOT NULL,
    NOMBRE  VARCHAR(20) NOT NULL,
    APELLIDOS VARCHAR(100) NOT NULL,
    DIRECCION VARCHAR(50),
    EDAD INT,
    NOTA VARCHAR(40),
    PRIMARY KEY (ID))"""

mysql_db.execute_interactive_sql(sql=create_table_sql)

Executed

CREATE TABLE people(
    ID INT(11) NOT NULL AUTO_INCREMENT,
    MOMENTO TIMESTAMP NOT NULL,
    NOMBRE  VARCHAR(20) NOT NULL,
    APELLIDOS VARCHAR(100) NOT NULL,
    DIRECCION VARCHAR(50),
    EDAD INT,
    NOTA VARCHAR(40),
    PRIMARY KEY (ID))

 successfully

1

============== 

### SELECT TABLE

In [8]:
# Select
select_sql = """SELECT * FROM people"""
select_result = mysql_db.execute_get_sql(sql=select_sql)

# tupla de tuplas
type(select_result)

Executing:
 SELECT * FROM people

tuple

In [9]:
select_result

()

============== 

### INSERT TABLE

In [10]:
# Insert

to_insert_1 = ["Pepit@", "Wolfram_Eustaquio", "Calle Bellavista 9º-B", "67", "Enfermedad: Ceguera"]
to_insert_2 = ["Juanita", "Data Science", "Calle Recoletos", "15", "Está muy alegre siempre"]

sql_to_insert_1 = mysql_db.generate_insert_into_people_sql(to_insert=to_insert_1)
sql_to_insert_2 = mysql_db.generate_insert_into_people_sql(to_insert=to_insert_2)

In [11]:
sql_to_insert_1

"INSERT INTO people (MOMENTO, NOMBRE, APELLIDOS, DIRECCION, EDAD, NOTA) VALUES (NOW(), 'Pepit@', 'Wolfram_Eustaquio', 'Calle Bellavista 9º-B', '67', 'Enfermedad: Ceguera')"

In [12]:
# Otra forma de insert
mysql_db.execute_interactive_sql(sql="""INSERT INTO people 
(MOMENTO, NOMBRE, APELLIDOS, DIRECCION, EDAD, NOTA) 
VALUES 
(NOW(), 'Pepito', 'Wolfram_Eustaquio', 'Calle Bellavista 9º-B', '67', 'Enfermedad: Ceguera')""")

Executed

INSERT INTO people
(MOMENTO, NOMBRE, APELLIDOS, DIRECCION, EDAD, NOTA)
VALUES
(NOW(), 'Pepito', 'Wolfram_Eustaquio', 'Calle Bellavista 9º-B', '67', 'Enfermedad: Ceguera')

 successfully

1

In [13]:
mysql_db.execute_interactive_sql(sql=sql_to_insert_1)
mysql_db.execute_interactive_sql(sql=sql_to_insert_2)

Executed

INSERT INTO people (MOMENTO, NOMBRE, APELLIDOS, DIRECCION, EDAD, NOTA) VALUES (NOW(), 'Pepit@', 'Wolfram_Eustaquio', 'Calle Bellavista 9º-B', '67', 'Enfermedad: Ceguera')

 successfully
Executed

INSERT INTO people (MOMENTO, NOMBRE, APELLIDOS, DIRECCION, EDAD, NOTA) VALUES (NOW(), 'Juanita', 'Data Science', 'Calle Recoletos', '15', 'Está muy alegre siempre')

 successfully

1

=====================

### SELECT COLUMNS

In [14]:
select_sql = """SELECT * FROM people"""
select_result = mysql_db.execute_get_sql(sql=select_sql)
len(select_result)

Executing:
 SELECT * FROM people

3

In [15]:
sql_drop = """DELETE FROM people WHERE NOMBRE='Pepito';"""
mysql_db.execute_interactive_sql(sql=sql_drop)

Executed

DELETE FROM people WHERE NOMBRE='Pepito';

 successfully

1

In [16]:
select_sql = """SELECT * FROM people"""
select_result = mysql_db.execute_get_sql(sql=select_sql)
len(select_result)

Executing:
 SELECT * FROM people

2

# WITH PANDAS

### Select with pandas

In [17]:
import pymysql

mysql_db = MySQL(IP_DNS=IP_DNS, USER=USER, PASSWORD=PASSWORD, BD_NAME=BD_NAME, PORT=PORT)

# Version 1 
db = mysql_db.connect()
df = pd.read_sql("select * from people", con=db)
df

Connected to MySQL server [apr_july_2021_tb]

,ID,MOMENTO,NOMBRE,APELLIDOS,DIRECCION,EDAD,NOTA
0,2,2021-05-24 08:10:10,Pepit@,Wolfram_Eustaquio,Calle Bellavista 9º-B,67,Enfermedad: Ceguera
1,3,2021-05-24 08:10:11,Juanita,Data Science,Calle Recoletos,15,Está muy alegre siempre

In [18]:
db_connection_str

'mysql+pymysql://tb_user:tb_password@54.87.229.244:25001/apr_july_2021_tb'

In [19]:
# Version 2
db_connection_str = mysql_db.SQL_ALCHEMY

#string = 'mysql+pymysql://user:password@98.76.54.33:20001/apr_july_2021_tb'
db_connection = create_engine(db_connection_str)

df = pd.read_sql("select * from people", con=db_connection)
pd.set_option('display.expand_frame_repr', False)

df

   ID             MOMENTO   NOMBRE          APELLIDOS              DIRECCION  EDAD                     NOTA
0   2 2021-05-24 08:10:10   Pepit@  Wolfram_Eustaquio  Calle Bellavista 9º-B    67      Enfermedad: Ceguera
1   3 2021-05-24 08:10:11  Juanita       Data Science        Calle Recoletos    15  Está muy alegre siempre

### Insert from pandas

In [20]:
table_to_insert = "people"

df_to_insert = df.drop(columns=["ID"])
df_to_insert = df_to_insert[df_to_insert["NOMBRE"] == "Juanita"]
# if_exists tiene dos posibilidades: 
to_append = "append"
to_replace = "replace"

try:
    frame_sql = df_to_insert.to_sql(name=table_to_insert, con=db_connection, if_exists="append", index=False)
    print("Success")
except Exception as error:
    print(error)

Success

   ID             MOMENTO   NOMBRE          APELLIDOS              DIRECCION  EDAD                     NOTA
0   2 2021-05-24 08:10:10   Pepit@  Wolfram_Eustaquio  Calle Bellavista 9º-B    67      Enfermedad: Ceguera
1   3 2021-05-24 08:10:11  Juanita       Data Science        Calle Recoletos    15  Está muy alegre siempre
2   4 2021-05-24 08:10:11  Juanita       Data Science        Calle Recoletos    15  Está muy alegre siempre

In [22]:
df = pd.read_sql("select * from people", con=db_connection)
df

   ID             MOMENTO   NOMBRE          APELLIDOS              DIRECCION  EDAD                     NOTA
0   2 2021-05-24 08:10:10   Pepit@  Wolfram_Eustaquio  Calle Bellavista 9º-B    67      Enfermedad: Ceguera
1   3 2021-05-24 08:12:13  Juanita       Data Science        Calle Recoletos   102  Está muy alegre siempre
2   4 2021-05-24 08:12:13  Juanita       Data Science        Calle Recoletos   102  Está muy alegre siempre

=============================

### Update row

In [21]:
sql_update = """UPDATE people set EDAD=102 WHERE NOMBRE='Juanita';"""

mysql_db.execute_interactive_sql(sql=sql_update)

Executed

UPDATE people set EDAD=102 WHERE NOMBRE='Juanita';

 successfully

1

In [23]:
mysql_db.close()

Close connection with MySQL server [apr_july_2021_tb]

### Ejemplo trabajar directamente con pandas

In [24]:
# Version 2
db_connection_str = mysql_db.SQL_ALCHEMY
db_connection = create_engine(db_connection_str)

df1 = pd.read_sql("select * from people", con=db_connection)

df1

   ID             MOMENTO   NOMBRE          APELLIDOS              DIRECCION  EDAD                     NOTA
0   2 2021-05-24 08:10:10   Pepit@  Wolfram_Eustaquio  Calle Bellavista 9º-B    67      Enfermedad: Ceguera
1   3 2021-05-24 08:12:13  Juanita       Data Science        Calle Recoletos   102  Está muy alegre siempre
2   4 2021-05-24 08:12:13  Juanita       Data Science        Calle Recoletos   102  Está muy alegre siempre

In [25]:
df1 = df1[df1.ID <= 3]
df1

   ID             MOMENTO   NOMBRE          APELLIDOS              DIRECCION  EDAD                     NOTA
0   2 2021-05-24 08:10:10   Pepit@  Wolfram_Eustaquio  Calle Bellavista 9º-B    67      Enfermedad: Ceguera
1   3 2021-05-24 08:12:13  Juanita       Data Science        Calle Recoletos   102  Está muy alegre siempre

In [ ]:
# Example

table_to_insert = "people"

to_append = "append"
to_replace = "replace"

try:
    frame_sql = df1.to_sql(name="people", con=db_connection, if_exists="append", index=False)
    print("Success")
except Exception as error:
    print(error)

### Interactuando directamente con la base de datos sin pasar por pandas

In [28]:
sql2 = """DELETE FROM people WHERE ID>3;"""

mysql_db.execute_interactive_sql(sql=sql2)

Executed

DELETE FROM people WHERE ID>3;

 successfully

1

In [29]:
df1 = pd.read_sql("select * from people", con=db_connection)

df1

   ID             MOMENTO   NOMBRE          APELLIDOS              DIRECCION  EDAD                     NOTA
0   2 2021-05-24 08:10:10   Pepit@  Wolfram_Eustaquio  Calle Bellavista 9º-B    67      Enfermedad: Ceguera
1   3 2021-05-24 08:12:13  Juanita       Data Science        Calle Recoletos   102  Está muy alegre siempre